{"pages":[],"posts":[{"title":"Integrasi VueJS dengan Algolia","text":"Mungkin ini bisa dibilang post pertama heheKali ini sesuai judul mau ngebahas cara mengintegrasikan VueJS dengan Algolia.Pertama apa itu Algolia? Algolia itu seperti hosted search engine API. Sesuai pengertiannya resource atau database kita akan disimpan ke server Algolia yang akan dijadikan API untuk keperluan searching.Hampir mirip-mirip lah dengan ElasticSearch. Nah keunggulan Algolia ini respon lebih cepat ketika melakukan query karena sesuai apa yang mereka bilang. https://www.algolia.com/infra Our search API powers billions of queries for thousands of companies every month, delivering relevant results in under 100ms anywhere in the world. Juga memiliki DSN (Distributed Search Network) sebagai infrastrukturnya. Jadi setiap melakukan pencarian kamu akan diarahkan server terdekat mereka.Sebagai contoh kamu berada di Jakarta, Indonesia mau mencari data, mak akan diarahkan ke server Singapore dan latency tentunya akan lebih kecil.Sama seperti sistemnya CDN yang biasa digunakan untuk distribusi konten. Contoh implementasi Langsung ke tutorialnya Membuat AkunSebelum menggunakan Algolia kamu dihadapkan untuk mendaftar terlebih dahulu. Kali ini saya menggunakan akun Free (Community), dan harus mencantumkan banner “Search by Algolia”. Tinggal ikuti saja tutorial”nya.Setelah itu akan dihadapkan ke dasbor Algolia. Membuat Index Pertama KaliIndex yaitu entitas pada Algolia yang akan memungkinkan kamu menentukan atribut yang akan dicari, rank atau urutan, dan masih banyak lagi tentunya. Pada halaman awal Indinces kamu harus membuat indeks terlebih dahulu.Sebagai contoh saya buat index “karyawan” Setelah itu akan diarahkan ke halaman index yang dibuat. Lalu buat record.Sebagai contoh menggunakan dummy data ini. 1234567891011121314151617181920212223242526272829303132[ &#123; \"_id\": \"5ad976f228c7fa1ba5df2bf9\", \"name\": \"Campbell Washington\", \"gender\": \"male\" &#125;, &#123; \"_id\": \"5ad976f25ed94410475c3e2a\", \"name\": \"Fran Smith\", \"gender\": \"female\" &#125;, &#123; \"_id\": \"5ad976f29e0623981752a211\", \"name\": \"Sophia Montgomery\", \"gender\": \"female\" &#125;, &#123; \"_id\": \"5ad976f23c61f0b4ec1bf226\", \"name\": \"Golden Atkins\", \"gender\": \"male\" &#125;, &#123; \"_id\": \"5ad976f2045ed6ce32d682d2\", \"name\": \"Alberta Mccullough\", \"gender\": \"female\" &#125;, &#123; \"_id\": \"5ad976f291d71041b56fa175\", \"name\": \"Hinton Harrell\", \"gender\": \"male\" &#125;] Oke data sudah ditambahkan :) Membuat API untuk integrasiPada halaman “API Keys” kamu harus membuat API Keys baru atau menggunakan API Keys yang sudah ada pada “Your Keys”Kamu bisa kustomisasikan API yang dibuat misal hanya untuk digunakan pada URL mana dan juga hak akses apa untuk API key tersebut. Integrasi dengan VueJSPpastikan module “vue-instantsearch” sudah terpasang.yarn add vue-instantsearch 12import InstantSearch from 'vue-instantsearch';Vue.use(InstantSearch); Cocokkan dengan API yang dibuat sebelumnya123456789101112131415161718&lt;template&gt;&lt;div id=\"app\"&gt; &lt;ais-index app-id=\"\" api-key=\"\" index-name=\"\" &gt; &lt;ais-search-box&gt;&lt;/ais-search-box&gt; &lt;ais-results&gt; &lt;template slot-scope=\"&#123; result &#125;\"&gt; &lt;h2&gt; &lt;ais-highlight :result=\"result\" attribute-name=\"name\"&gt;&lt;/ais-highlight&gt; &lt;/h2&gt; &lt;/template&gt; &lt;/ais-results&gt; &lt;/ais-index&gt;&lt;/div&gt;&lt;/template&gt; Hasilnya Silahkan kreasikan design kamu dan untuk selengkapnya mengenai component pada InstantSearchBisa baca dokumentasi ini. KesimpulanAlgolia ini sangat cocok buat kamu yang pengen buat Search Engine sendiri namun respon yang cepat dan tidak ribet dengan kodinganmu sendiri. Fitur yang ditawarkan pada akun Free itu lebih dari cukup untuk saya. Dengan maximum 30 queries per detik dan bisa diatur batasannya di pengaturan API dan penyimpanan records sekitar 10k dan 1000 operations itu cukup untuk penggunaan yang… ya lumayanlah :)Ada juga akun Essentials yang bisa kamu dapatkan gratis kalau project yang kamu buat dan gunakan itu berbasis Open Source. Perlu dikualifikasi dulu deh :D","link":"/tegrasi-VueJS-dengan-Algolia.html"},{"title":"Hello World","text":"Just hello world post :)","link":"/Hello-World.html"}],"tags":[{"name":"vuejs","slug":"vuejs","link":"/tags/vuejs/"},{"name":"search","slug":"search","link":"/tags/search/"},{"name":"javascript","slug":"javascript","link":"/tags/javascript/"}],"categories":[]}